{"config": [{"config": {"name": "Crop", "trainable": true, "input_dtype": "float32", "cropping": [[50, 20], [0, 0]], "batch_input_shape": [null, 160, 320, 3]}, "class_name": "Cropping2D"}, {"config": {"name": "Normalize", "axis": 1, "epsilon": 0.001, "beta_regularizer": null, "trainable": true, "mode": 0, "gamma_regularizer": null, "momentum": 0.99}, "class_name": "BatchNormalization"}, {"config": {"dim_ordering": "tf", "init": "glorot_uniform", "border_mode": "valid", "nb_filter": 24, "trainable": true, "activity_regularizer": null, "activation": "linear", "b_regularizer": null, "name": "Convolution2D1", "nb_col": 5, "W_regularizer": {"name": "L1L2Regularizer", "l2": 0.0010000000474974513, "l1": 0.0}, "subsample": [2, 2], "bias": true, "b_constraint": null, "nb_row": 5, "W_constraint": null}, "class_name": "Convolution2D"}, {"config": {"name": "elu_8", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"dim_ordering": "tf", "init": "glorot_uniform", "border_mode": "valid", "nb_filter": 36, "trainable": true, "activity_regularizer": null, "activation": "linear", "b_regularizer": null, "name": "Convolution2D2", "nb_col": 5, "W_regularizer": {"name": "L1L2Regularizer", "l2": 0.0010000000474974513, "l1": 0.0}, "subsample": [2, 2], "bias": true, "b_constraint": null, "nb_row": 5, "W_constraint": null}, "class_name": "Convolution2D"}, {"config": {"name": "elu_9", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"dim_ordering": "tf", "init": "glorot_uniform", "border_mode": "valid", "nb_filter": 48, "trainable": true, "activity_regularizer": null, "activation": "linear", "b_regularizer": null, "name": "Convolution2D3", "nb_col": 5, "W_regularizer": {"name": "L1L2Regularizer", "l2": 0.0010000000474974513, "l1": 0.0}, "subsample": [2, 2], "bias": true, "b_constraint": null, "nb_row": 5, "W_constraint": null}, "class_name": "Convolution2D"}, {"config": {"dim_ordering": "tf", "init": "glorot_uniform", "border_mode": "valid", "nb_filter": 64, "trainable": true, "activity_regularizer": null, "activation": "linear", "b_regularizer": null, "name": "Convolution2D4", "nb_col": 3, "W_regularizer": {"name": "L1L2Regularizer", "l2": 0.0010000000474974513, "l1": 0.0}, "subsample": [1, 1], "bias": true, "b_constraint": null, "nb_row": 3, "W_constraint": null}, "class_name": "Convolution2D"}, {"config": {"name": "elu_10", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"dim_ordering": "tf", "init": "glorot_uniform", "border_mode": "valid", "nb_filter": 64, "trainable": true, "activity_regularizer": null, "activation": "linear", "b_regularizer": null, "name": "Convolution2D5", "nb_col": 3, "W_regularizer": {"name": "L1L2Regularizer", "l2": 0.0010000000474974513, "l1": 0.0}, "subsample": [1, 1], "bias": true, "b_constraint": null, "nb_row": 3, "W_constraint": null}, "class_name": "Convolution2D"}, {"config": {"name": "elu_11", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"name": "Flatten", "trainable": true}, "class_name": "Flatten"}, {"config": {"W_constraint": null, "init": "glorot_uniform", "trainable": true, "activity_regularizer": null, "activation": "linear", "b_regularizer": null, "name": "FC2", "input_dim": 8448, "W_regularizer": {"name": "L1L2Regularizer", "l2": 0.0010000000474974513, "l1": 0.0}, "output_dim": 100, "bias": true, "b_constraint": null}, "class_name": "Dense"}, {"config": {"name": "elu_12", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"W_constraint": null, "init": "glorot_uniform", "trainable": true, "activity_regularizer": null, "activation": "linear", "b_regularizer": null, "name": "FC3", "input_dim": 100, "W_regularizer": {"name": "L1L2Regularizer", "l2": 0.0010000000474974513, "l1": 0.0}, "output_dim": 50, "bias": true, "b_constraint": null}, "class_name": "Dense"}, {"config": {"name": "elu_13", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"W_constraint": null, "init": "glorot_uniform", "trainable": true, "activity_regularizer": null, "activation": "linear", "b_regularizer": null, "name": "FC4", "input_dim": 50, "W_regularizer": {"name": "L1L2Regularizer", "l2": 0.0010000000474974513, "l1": 0.0}, "output_dim": 10, "bias": true, "b_constraint": null}, "class_name": "Dense"}, {"config": {"name": "elu_14", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"W_constraint": null, "init": "glorot_uniform", "trainable": true, "activity_regularizer": null, "activation": "linear", "b_regularizer": null, "name": "Readout", "input_dim": 10, "W_regularizer": null, "output_dim": 1, "bias": true, "b_constraint": null}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.2.2"}